In [1]:
import numpy as np 
import pandas as pd

In [9]:
reptiles = pd.DataFrame(np.arange(16).reshape(4,4), index=[1,2,3,4], columns=['Cobra','Crocodile','Lizard','Chameleon'])
reptiles

   Cobra  Crocodile  Lizard  Chameleon
1      0          1       2          3
2      4          5       6          7
3      8          9      10         11
4     12         13      14         15

In [10]:
reptiles[reptiles['Lizard']>5]

   Cobra  Crocodile  Lizard  Chameleon
2      4          5       6          7
3      8          9      10         11
4     12         13      14         15

In [11]:
reptiles < 6

   Cobra  Crocodile  Lizard  Chameleon
1   True       True    True       True
2   True       True   False      False
3  False      False   False      False
4  False      False   False      False

In [12]:
reptiles[reptiles > 10] = 20
reptiles

   Cobra  Crocodile  Lizard  Chameleon
1      0          1       2          3
2      4          5       6          7
3      8          9      10         20
4     20         20      20         20

In [15]:
reptiles.loc[2, ['Cobra','Crocodile']]

Cobra        4
Crocodile    5
Name: 2, dtype: int32

In [16]:
reptiles.iloc[2,[3,0,1]]

Chameleon    20
Cobra         8
Crocodile     9
Name: 3, dtype: int32

In [17]:
data.iloc[2]

Cobra         8
Crocodile     9
Lizard       10
Chameleon    11
Name: 3, dtype: int32

In [18]:
data.iloc[[1,2],[3,0,1]]

   Chameleon  Cobra  Crocodile
2          7      4          5
3         11      8          9

In [19]:
reptiles.loc[:2,'Cobra']

1    0
2    4
Name: Cobra, dtype: int32

In [20]:
reptiles.iloc[:, :3][reptiles.Cobra > 5]

   Cobra  Crocodile  Lizard
3      8          9      10
4     20         20      20

In [21]:
#iloc: select by integer position
#loc: select by label

### Inter Position

In [22]:
zzz = pd.Series(np.arange(3.))
zzz

0    0.0
1    1.0
2    2.0
dtype: float64

In [24]:
zzz2 = pd.Series(np.arange(3.), index= ['z','x','y'])
zzz2

z    0.0
x    1.0
y    2.0
dtype: float64

In [33]:
zzz2[0:1]

z    0.0
dtype: float64

In [34]:
zzz2.iloc[:1]

z    0.0
dtype: float64

### Arithmetic and Data Alingnment

In [35]:
yyy = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a','c','d','e'])
yyy

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [36]:
iii = pd.Series([-2.1,3.6,-1.5,4,3.1], index= ['a','c','e','f','g'])
iii

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [37]:
yyy + iii

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [50]:
anfiber = pd.DataFrame(np.arange(9.).reshape((3,3)), columns=list('bcd'),
index=['Frog', 'Toad', 'Axolote'])
anfiber

           b    c    d
Frog     0.0  1.0  2.0
Toad     3.0  4.0  5.0
Axolote  6.0  7.0  8.0

In [51]:
anfiber2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
index=['Merman', 'Urodela', 'Caudata', 'Apoda'])
anfiber2

           b     d     e
Merman   0.0   1.0   2.0
Urodela  3.0   4.0   5.0
Caudata  6.0   7.0   8.0
Apoda    9.0  10.0  11.0

In [52]:
anfiber + anfiber2

          b   c   d   e
Apoda   NaN NaN NaN NaN
Axolote NaN NaN NaN NaN
Caudata NaN NaN NaN NaN
Frog    NaN NaN NaN NaN
Merman  NaN NaN NaN NaN
Toad    NaN NaN NaN NaN
Urodela NaN NaN NaN NaN